{
  "add_prefix_space": false,
  "auto_map": {
    "AutoProcessor": "processing_paddleocr_vl.PaddleOCRVLProcessor"
  },
  "backend": "tokenizers",
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": false,
  "cls_token": "<|begin_of_sentence|>",
  "eos_token": "</s>",
  "extra_special_tokens": [
    "<|IMAGE_PLACEHOLDER|>",
    "<|image_pad|>",
    "<|IMAGE_START|>",
    "<|IMAGE_END|>",
    "<|video_pad|>"
  ],
  "image_token": "<|IMAGE_PLACEHOLDER|>",
  "is_local": false,
  "legacy": true,
  "mask_token": "<mask:1>",
  "model_max_length": 131072,
  "model_specific_special_tokens": {},
  "pad_token": "<unk>",
  "processor_class": "PaddleOCRVLProcessor",
  "sep_token": "<|end_of_sentence|>",
  "sp_model_kwargs": {},
  "spaces_between_special_tokens": false,
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "<unk>",
  "use_default_system_prompt": false
}
